In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df1 = DataFrame({'Name':list('ABCDEFGHIJ'),'Score':np.random.randint(1,110,10)})

In [3]:
df1

  Name  Score
0    A     53
1    B    107
2    C      9
3    D     50
4    E     46
5    F     86
6    G    109
7    H     75
8    I     58
9    J     99

In [4]:
df1['Default Rank'] = df1['Score'].rank()

In [5]:
df1

  Name  Score  Default Rank
0    A     53           4.0
1    B    107           9.0
2    C      9           1.0
3    D     50           3.0
4    E     46           2.0
5    F     86           7.0
6    G    109          10.0
7    H     75           6.0
8    I     58           5.0
9    J     99           8.0

In [6]:

df1['Descending Rank'] = df1['Score'].rank(ascending = False)

In [7]:
df1

  Name  Score  Default Rank  Descending Rank
0    A     53           4.0              7.0
1    B    107           9.0              2.0
2    C      9           1.0             10.0
3    D     50           3.0              8.0
4    E     46           2.0              9.0
5    F     86           7.0              4.0
6    G    109          10.0              1.0
7    H     75           6.0              5.0
8    I     58           5.0              6.0
9    J     99           8.0              3.0

In [8]:
df1['Max Rank']= df1['Score'].rank(method='max')

In [9]:
df1

  Name  Score  Default Rank  Descending Rank  Max Rank
0    A     53           4.0              7.0       4.0
1    B    107           9.0              2.0       9.0
2    C      9           1.0             10.0       1.0
3    D     50           3.0              8.0       3.0
4    E     46           2.0              9.0       2.0
5    F     86           7.0              4.0       7.0
6    G    109          10.0              1.0      10.0
7    H     75           6.0              5.0       6.0
8    I     58           5.0              6.0       5.0
9    J     99           8.0              3.0       8.0

In [10]:
df1['Min Rank']= df1['Score'].rank(method='min')

In [11]:
df1

  Name  Score  Default Rank  Descending Rank  Max Rank  Min Rank
0    A     53           4.0              7.0       4.0       4.0
1    B    107           9.0              2.0       9.0       9.0
2    C      9           1.0             10.0       1.0       1.0
3    D     50           3.0              8.0       3.0       3.0
4    E     46           2.0              9.0       2.0       2.0
5    F     86           7.0              4.0       7.0       7.0
6    G    109          10.0              1.0      10.0      10.0
7    H     75           6.0              5.0       6.0       6.0
8    I     58           5.0              6.0       5.0       5.0
9    J     99           8.0              3.0       8.0       8.0

In [12]:
df1['Dense Rank'] = df1['Score'].rank(method='dense')

In [13]:
df1

  Name  Score  Default Rank  Descending Rank  Max Rank  Min Rank  Dense Rank
0    A     53           4.0              7.0       4.0       4.0         4.0
1    B    107           9.0              2.0       9.0       9.0         9.0
2    C      9           1.0             10.0       1.0       1.0         1.0
3    D     50           3.0              8.0       3.0       3.0         3.0
4    E     46           2.0              9.0       2.0       2.0         2.0
5    F     86           7.0              4.0       7.0       7.0         7.0
6    G    109          10.0              1.0      10.0      10.0        10.0
7    H     75           6.0              5.0       6.0       6.0         6.0
8    I     58           5.0              6.0       5.0       5.0         5.0
9    J     99           8.0              3.0       8.0       8.0         8.0

In [14]:
df1['First Rank'] = df1['Score'].rank(method='first')

In [15]:
df1

,Name,Score,Default Rank,Descending Rank,Max Rank,Min Rank,Dense Rank,First Rank
0,A,53,4.0,7.0,4.0,4.0,4.0,4.0
1,B,107,9.0,2.0,9.0,9.0,9.0,9.0
2,C,9,1.0,10.0,1.0,1.0,1.0,1.0
3,D,50,3.0,8.0,3.0,3.0,3.0,3.0
4,E,46,2.0,9.0,2.0,2.0,2.0,2.0
5,F,86,7.0,4.0,7.0,7.0,7.0,7.0
6,G,109,10.0,1.0,10.0,10.0,10.0,10.0
7,H,75,6.0,5.0,6.0,6.0,6.0,6.0
8,I,58,5.0,6.0,5.0,5.0,5.0,5.0
9,J,99,8.0,3.0,8.0,8.0,8.0,8.0

## Dropping Null Values2

In [16]:
import numpy as pd
import pandas as pd
from pandas import Series,DataFrame

In [17]:
s1 = Series([1,np.nan,np.nan,3,4])

#

In [18]:
s1

0    1.0
1    NaN
2    NaN
3    3.0
4    4.0
dtype: float64

In [19]:
s1.isnull()

0    False
1     True
2     True
3    False
4    False
dtype: bool

In [20]:
s1.notnull()

0     True
1    False
2    False
3     True
4     True
dtype: bool

In [21]:
s1.isnull().sum()

2

In [22]:
s1.notnull().sum()

3

In [23]:
df1 = DataFrame(np.array([[1,np.nan,np.nan],[np.nan,2,3],[2,3,4]]),
                columns = list('ABC'))

In [24]:
df1

     A    B    C
0  1.0  NaN  NaN
1  NaN  2.0  3.0
2  2.0  3.0  4.0

In [25]:
df1.isnull()

       A      B      C
0  False   True   True
1   True  False  False
2  False  False  False

In [26]:
df1.notnull()

       A      B      C
0   True  False  False
1  False   True   True
2   True   True   True

In [27]:
df1['A'].isnull()

0    False
1     True
2    False
Name: A, dtype: bool

In [28]:
df1['A'].isnull().sum()

1

### Dropping null3

In [29]:
s1

0    1.0
1    NaN
2    NaN
3    3.0
4    4.0
dtype: float64

In [30]:
s1.dropna()

0    1.0
3    3.0
4    4.0
dtype: float64

In [31]:
s1.dropna(inplace=True)

In [32]:
s1

0    1.0
3    3.0
4    4.0
dtype: float64

In [33]:
df1

     A    B    C
0  1.0  NaN  NaN
1  NaN  2.0  3.0
2  2.0  3.0  4.0

In [34]:
df1.dropna()

     A    B    C
2  2.0  3.0  4.0

In [35]:
df1.dropna(axis =1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [36]:
df2 = DataFrame(np.array([[1,2,3],[4,5,np.nan],[np.nan,2,3],[np.nan,np.nan,np.nan]]),
                        columns = list('ABC'))

In [37]:
df2

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  NaN  2.0  3.0
3  NaN  NaN  NaN

In [38]:
df2.dropna(how= 'any')

     A    B    C
0  1.0  2.0  3.0

In [39]:
df2.dropna(how= 'all')

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  NaN  2.0  3.0

In [40]:
df2['C'].dropna()

0    3.0
2    3.0
Name: C, dtype: float64

In [41]:
df2

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  NaN  2.0  3.0
3  NaN  NaN  NaN

In [42]:
df2.dropna(thresh =1)

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  NaN  2.0  3.0

In [43]:
df2.dropna(thresh =2)

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  NaN  2.0  3.0

### Filling null value in Data3

In [44]:
import numpy as np
import pandas as pd
from pandas import Series ,DataFrame

In [45]:
df2 = DataFrame(np.array([[1,2,3],[4,5,np.nan],[np.nan,2,3],[np.nan,np.nan,np.nan]]),
                columns = list('ABC'))

##

In [46]:
df2

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  NaN  2.0  3.0
3  NaN  NaN  NaN

In [47]:
df2.fillna(10)

      A     B     C
0   1.0   2.0   3.0
1   4.0   5.0  10.0
2  10.0   2.0   3.0
3  10.0  10.0  10.0

In [48]:
df2

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  NaN  2.0  3.0
3  NaN  NaN  NaN

In [49]:
df2['C'].fillna(10)

0     3.0
1    10.0
2     3.0
3    10.0
Name: C, dtype: float64

In [50]:
df2['C'].fillna(10,inplace= True)

In [51]:
df2

     A    B     C
0  1.0  2.0   3.0
1  4.0  5.0  10.0
2  NaN  2.0   3.0
3  NaN  NaN  10.0

In [52]:
df2 = DataFrame(np.array([[1,2,3],[4,5,np.nan],[np.nan,2,3],[np.nan,np.nan,np.nan]]),
                columns = list('ABC'))

In [53]:
df2

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  NaN  2.0  3.0
3  NaN  NaN  NaN

In [54]:
df2.fillna(method = 'ffill')

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  3.0
2  4.0  2.0  3.0
3  4.0  2.0  3.0

In [55]:
df2.fillna(method ='bfill')

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  3.0
2  NaN  2.0  3.0
3  NaN  NaN  NaN

### Drop Function

In [56]:
import numpy as np
import pandas as pd
from pandas import Series ,DataFrame

In [57]:
df1 = DataFrame(np.arange(1,26).reshape(5,5),
                index = list('ABCDE'),
                columns = list('UVWXY'))

In [58]:
df1

    U   V   W   X   Y
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [59]:
del df1['Y']

In [60]:
df1

    U   V   W   X
A   1   2   3   4
B   6   7   8   9
C  11  12  13  14
D  16  17  18  19
E  21  22  23  24

In [61]:
df1.drop('U',axis = 1)

    V   W   X
A   2   3   4
B   7   8   9
C  12  13  14
D  17  18  19
E  22  23  24

In [62]:
df1.drop('U',axis = 1 ,inplace = True)

In [63]:
df1

    V   W   X
A   2   3   4
B   7   8   9
C  12  13  14
D  17  18  19
E  22  23  24

In [64]:
df1.drop(['V','W'],inplace = True, axis = 1)

In [65]:
df1

    X
A   4
B   9
C  14
D  19
E  24

In [66]:
df1.drop('A')

    X
B   9
C  14
D  19
E  24

In [67]:
ser1 = Series(np.arange(5),index = list('ABCDE'))

In [68]:
ser1

A    0
B    1
C    2
D    3
E    4
dtype: int32

In [69]:
ser1.drop('B')

A    0
C    2
D    3
E    4
dtype: int32

### Renaming Funtion3

In [70]:
import numpy as pd
import pandas as pd
from pandas import Series, DataFrame

In [71]:
ser1

A    0
B    1
C    2
D    3
E    4
dtype: int32

In [72]:
ser1.rename({'A': 'Alpha'})

Alpha    0
B        1
C        2
D        3
E        4
dtype: int32

In [73]:
ser1.rename({'A': 'Alpha'},inplace = True)

In [74]:
ser1

Alpha    0
B        1
C        2
D        3
E        4
dtype: int32

In [75]:
df1 = DataFrame(np.arange(1,10).reshape(3,3),index = ['NY','LA','SF'],
      columns = list('ABC'))

In [76]:
df1

    A  B  C
NY  1  2  3
LA  4  5  6
SF  7  8  9

In [77]:
df1. rename({'NY':'New Youk'})

          A  B  C
New Youk  1  2  3
LA        4  5  6
SF        7  8  9

### Replacing Data3

In [78]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [79]:
s1 = Series([1,2,3,4,5,6,7])

In [80]:
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [81]:
s1.replace({1:100,4:400,2:200})

0    100
1    200
2      3
3    400
4      5
5      6
6      7
dtype: int64

In [82]:
s1.replace([1,3],[200,300],inplace =True)

In [83]:
s1

0    200
1      2
2    300
3      4
4      5
5      6
6      7
dtype: int64

In [84]:
df1 = DataFrame(np.arange(1,26).reshape(5,5),columns = list('ABCDE'))

In [85]:
df1['A'].replace({6:16}, inplace = True)

In [86]:
df1

    A   B   C   D   E
0   1   2   3   4   5
1  16   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

### Pivoting Operation

In [87]:
import pandas as pd
import numpy as np
from pandas import Series ,DataFrame

In [88]:
Df1 = DataFrame({'Variable':list('AAABBBCCCDDD'),
                 'Value': [1,2,3,1,2,3,1,2,3,1,2,3],
                 'Data': np.random.randn(12)})

In [89]:
Df1

   Variable  Value      Data
0         A      1  1.831614
1         A      2  0.317481
2         A      3  0.782206
3         B      1  0.307832
4         B      2 -0.445171
5         B      3  2.217482
6         C      1 -0.077014
7         C      2  0.400907
8         C      3  2.376472
9         D      1 -0.413720
10        D      2  1.148720
11        D      3  0.393793

In [90]:
Df1.pivot('Variable','Value','Data')

C:\Users\Dell\AppData\Local\Temp\ipykernel_3260\2990142298.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  Df1.pivot('Variable','Value','Data')

Value            1         2         3
Variable
A         1.831614  0.317481  0.782206
B         0.307832 -0.445171  2.217482
C        -0.077014  0.400907  2.376472
D        -0.413720  1.148720  0.393793

In [91]:
Df1.pivot('Value','Variable','Data')

C:\Users\Dell\AppData\Local\Temp\ipykernel_3260\431351794.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  Df1.pivot('Value','Variable','Data')

Variable         A         B         C         D
Value
1         1.831614  0.307832 -0.077014 -0.413720
2         0.317481 -0.445171  0.400907  1.148720
3         0.782206  2.217482  2.376472  0.393793

In [92]:
Df1.pivot('Data','Variable','Value')

C:\Users\Dell\AppData\Local\Temp\ipykernel_3260\2700118508.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  Df1.pivot('Data','Variable','Value')

Variable     A    B    C    D
Data
-0.445171  NaN  2.0  NaN  NaN
-0.413720  NaN  NaN  NaN  1.0
-0.077014  NaN  NaN  1.0  NaN
 0.307832  NaN  1.0  NaN  NaN
 0.317481  2.0  NaN  NaN  NaN
 0.393793  NaN  NaN  NaN  3.0
 0.400907  NaN  NaN  2.0  NaN
 0.782206  3.0  NaN  NaN  NaN
 1.148720  NaN  NaN  NaN  2.0
 1.831614  1.0  NaN  NaN  NaN
 2.217482  NaN  3.0  NaN  NaN
 2.376472  NaN  NaN  3.0  NaN

In [93]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [101]:
s1 = Series([1,2,3,4,5],index = [['A','A','B','B','B'],[1,3,1,3,1]])

In [102]:
s1

A  1    1
   3    2
B  1    3
   3    4
   1    5
dtype: int64

In [103]:
s1['A']

1    1
3    2
dtype: int64

In [105]:
s1['B']

1    3
3    4
1    5
dtype: int64

In [104]:
s1

A  1    1
   3    2
B  1    3
   3    4
   1    5
dtype: int64

In [106]:
s1.index

MultiIndex([('A', 1),
            ('A', 3),
            ('B', 1),
            ('B', 3),
            ('B', 1)],
           )

In [107]:
s1.values

array([1, 2, 3, 4, 5], dtype=int64)

## Operation On Multi-Level2

In [108]:
df1 = DataFrame(np.arange(1,26).reshape(5,5),index=[['A','A','B','B','B'],[3,5,1,5,9]])

In [109]:
df1

      0   1   2   3   4
A 3   1   2   3   4   5
  5   6   7   8   9  10
B 1  11  12  13  14  15
  5  16  17  18  19  20
  9  21  22  23  24  25

In [112]:
df1 = DataFrame(np.arange(1,26).reshape(5,5),index=[['A','A','B','B','B'],[3,5,1,5,9]],
               columns =[['India','Bharat','Nepal','Mha','UP'],['North','South','West','Sss','ww']])

In [113]:
df1

    India Bharat Nepal Mha  UP
    North  South  West Sss  ww
A 3     1      2     3   4   5
  5     6      7     8   9  10
B 1    11     12    13  14  15
  5    16     17    18  19  20
  9    21     22    23  24  25

In [114]:
df1['India']

     North
A 3      1
  5      6
B 1     11
  5     16
  9     21

In [115]:
df1['Mha']

     Sss
A 3    4
  5    9
B 1   14
  5   19
  9   24

In [116]:
df1.columns

MultiIndex([( 'India', 'North'),
            ('Bharat', 'South'),
            ( 'Nepal',  'West'),
            (   'Mha',   'Sss'),
            (    'UP',    'ww')],
           )

In [117]:
df1.index

MultiIndex([('A', 3),
            ('A', 5),
            ('B', 1),
            ('B', 5),
            ('B', 9)],
           )

In [118]:
df1

    India Bharat Nepal Mha  UP
    North  South  West Sss  ww
A 3     1      2     3   4   5
  5     6      7     8   9  10
B 1    11     12    13  14  15
  5    16     17    18  19  20
  9    21     22    23  24  25

In [119]:
df1.iloc[1]

India   North     6
Bharat  South     7
Nepal   West      8
Mha     Sss       9
UP      ww       10
Name: (A, 5), dtype: int32

In [120]:
df1.iloc[1,1]

7

In [121]:
df1.iloc[1:1]

Empty DataFrame
Columns: [(India, North), (Bharat, South), (Nepal, West), (Mha, Sss), (UP, ww)]
Index: []

In [122]:
df1.iloc[:2]

    India Bharat Nepal Mha  UP
    North  South  West Sss  ww
A 3     1      2     3   4   5
  5     6      7     8   9  10